l1 = ["张大仙", "徐凤年", ["李淳罡", "邓太阿"]]
l2 = l1

# 截图

# l1[0] = "陈平安"

# print(l1)
# print(l2)


# 浅拷贝 copy() 把原列表第一层的索引和内存地址 完全拷贝一份给新列表
# 若原列表存的全是不可变类型，则浅拷贝可正常使用
# 若原列表存包含了可变类型，那么浅拷贝的新列表就没办法和原列表完全分开了
l3 = l1.copy()
# print(l3)

# 列表id值不一致
# print(id(l1), id(l3))

# 列表里的值的id一致
# print(id(l1[0]), id(l1[1]),id(l1[2]))
# print(id(l3[0]), id(l3[1]),id(l3[2]))

l3[0] = "陈平安"
l3[1] = "徐晓"
l3[2][0] = "剑黄酒"
l3[2][0] = "王仙芝"
print(l1)
print(l3)


# 深拷贝
l1 = ["张大仙", "徐凤年", ["李淳罡", "邓太阿"]]
import copy

l3 = copy.deepcopy(l1)
# print(l3)
# print(id(l1), id(l3))
# print(id(l1[0]), id(l1[1]), id(l1[2]))
# print(id(l3[0]), id(l3[1]), id(l3[2]))
# print(id(l1[2][0]),id(l1[2][1]))
# print(id(l3[2][0]),id(l3[2][1]))

l3[0] = "陈平安"
l3[1] = "徐晓"
l3[2][0] = "剑黄酒"
l3[2][0] = "王仙芝"
print(l1)
print(l3)